#变量、数据类型、运算
#变量
#python中变量赋值不需要类型声明，属于动态语言
#变量赋值，表示指向 赋值符号
#常量
#不可变得量 用大写字母表示常量 （本质上没有不可变得量，只是人为不更改）
#数据类型：数字 字符串 列表 元祖 字典
#运算符： 算术、比较、赋值、逻辑、位、成员、身份
#函数
#方法


#数字类型
#创建时不可以被改变
#数字类型：整型 浮点型 负数 布尔 空数类型
#数字类型运算符：算术、比较、赋值、逻辑、位
#布尔类型数据可以使用逻辑运算符 or not and
#算术运算符有+ - * / // % **
#数字类型之间可以进行类型转换
#数学函数，三角函数，随机数函数可以对数字类型做处理





#常量
PI=3.24242424
print(PI)

#字符串
a="asdadsad\'"
print(a)

#整型
a=2342342423423
print(a)
a=-12313123213
print(a)
#浮点型
a=0.1231312312
print(a)


#运算符
print(10//3)
print(10/3)
print(10%3)

#布尔运算
print(3>2 and 3<2)
print(3>2 or 3<2)
print(not 3>2)







